#### AreaBasedLoadData Members

---

|  |
| --- |
| AreaBasedLoadData Class   Methods   Properties   See Also |

The  AreaBasedLoadData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddElectricalLoadArea | Adds electrical load area into the area based load. |
| Public method | Dispose | (Inherited from  ZoneElementDomainData  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetElectricalLoadAreas | Gets electrical load areas which the area based load includes. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | RemoveElectricalLoadArea | Removes electrical load area from the area based load. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ApparentLoad | The electrical apparent load of the area based load. |
| Public property | ApparentPowerDensity | The apparent power density of the area based load. |
| Public property | AreaBasedLoadType | The electrical area based load type of the area based load. |
| Public property | Current | The current of the area based load . |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ZoneElementDomainData  .) |
| Public property | LoadClassification | The load classification of the area based load. |
| Public property | LoadDensity | The load density of the area based load. |
| Public property | LoadType | The load type of the area based load. |
| Public property | PhasesNumber | The Phases Number of the area based load. |
| Public property | PowerFactor | The power factor of the area based load. |
| Public property | TrueLoad | The electrical true load of the area based load. |
| Public property | Voltage | The voltage of the area based load. |

# See Also

AreaBasedLoadData Class

Autodesk.Revit.DB.Electrical Namespace